[{"image": "https://www.007.com/wp-content/uploads/2022/03/QUAD_DC_Tux_SEPT30_MONOGRAM_AW_NTTD-scaled.jpg", "title": "No Time To Die", "synopsis": "After a flashback to Madeleine's childhood and an attack on her family home, in which the masked assassin Safin spares her life, Bond and Madeleine are enjoying a new life in Italy. Bond visits Vesper Lynd's family tomb to say his final goodbye but is set upon by SPECTRE agents led by the henchman Primo. The pair escape in the Aston Martin DB5. Bond believes that Madeleine has betrayed him and they part ways.\n In London, SPECTRE attacks again, destroying a laboratory that is developing a devastating bioweapon called Heracles, and kidnapping its chief scientist Valdo Obruchev. In the wake of the attack, Felix Leiter visits Bond in Jamaica and asks for his help. Bond sails to Cuba where he and CIA agent Paloma witness Heracles kill a gathering of SPECTRE agents. Bond beats the new double-0 agent to the capture of Obruchev and delivers him to Felix out at sea. The rogue CIA agent Logan Ash betrays them, killing Felix. Bond returns to London, desperate to avenge his friend's death. Bond receives a frosty reception from M although is eventually allowed to visit the incarcerated Blofeld. This precipitates a brief and painful reunion with Madeleine and elicits a number of startling revelations from Blofeld before he succumbs to a nasty death. Armed with fresh information, Bond tracks Madeleine to Norway and the pair reunite, learning about the villain Safin and enmity for SPECTRE from secret files collected by Madeleine's father, Mr White. Ash attacks them and Safin kidnaps Madeleine, taking her to his island base. M orders Bond and Nomi to attack and they rescue Madeleine, killing Obruchev, Primo and Safin. ", "cast": "Daniel Craig, Rami Malek, Léa Seydoux, Lashana Lynch, Ben Whishaw, Naomie Harris, Ralph Fiennes, Jeffrey Wright, Rory Kinnear, Christoph Waltz, David Dencik, Ana de Armas, Billy Magnussen, Dali Benssalah", "producers": "Michael G. Wilson, Barbara Broccoli", "director": "Cary Joji Fukunaga", "release date": "30 September 2021 (UK), 8 October 2021 (USA)", "world premiere": "28 September 2021, Royal Albert Hall, London", "locations": "Pinewood Studios, London locations, Dunsfold, RAF Brize Norton, Ascot, Salisbury Plain, Windsor Great Park, Aviemore, Ardverikie Estate Inverness-shire, Cairngorms National Park, Portsmouth and Devizes, UK; Faroe Islands; Matera, Gravina, Puglia and Sapri, Italy; Kingston and Port Antonio, Jamaica; Akershus, Langvann Lake, Grevevein, Hakadal, Hakadal Verk, Nittdedal, the Atlantic Road Vevang and Oslo, Norway", "music": "“No Time To Die” performed by Billie Eilish, written by Billie Eilish and Finneas O'Connell", "vehicles": "Aston Martin DB5, Land Rover Series III, Submersible Glider, Triumph Tiger 1200XE, Triumph Tiger 900, Aston Martin V8, Aston Martin DBS Superleggera, Aston Martin Valhalla, Land Rover Defender 110, Jaguar XF, Chevrolet Bel Air, Spirit 46 yacht, Royal Alloy Scooter, C17-Globemaster aircraft, Range Rover Sport, Range Rover Series 1, Lancia Thesis, Maserati Quattroporte, Toyota Land Cruiser, HMS Dragon Type 45 air defence destroyer", "gadgets/weapons/technology": "The official launch for the film took place at GoldenEye in Jamaica, once the home of Ian Fleming", "trivia": "The official launch for the film took place at GoldenEye in Jamaica, once the home of Ian Fleming", "bond actor": "Daniel Craig", "trailer": "https://www.youtube.com/embed/FREBR6FH1rg?feature=oembed&rel=0&controls=0&showinfo=0&modestbranding=1&"}, {"image": "https://www.007.com/wp-content/uploads/2021/01/SpectrePoster.jpg", "title": "Spectre", "synopsis": "On a rogue mission in Mexico City Bond kills an assassin. Back in London, Bond is grounded by M but confides in Moneypenny that he was acting on orders from the previous M before she died. Bond travels to Rome and infiltrates a secret meeting, but their leader Franz Oberhauser, reveals Bond's presence. The terrifying Hinx pursues Bond in a car chase. In Austria, Bond meets his old nemesis Mr White and makes a promise to keep Mr White's daughter safe in exchange for leading him to Oberhauser. The daughter, Dr Madeleine Swann, is reluctant to help, but after Bond rescues her from Hinx she agrees. She reveals the secret organisation is SPECTRE. Swann leads Bond to Tangier and from there they journey by train to a desert location, Swann makes Bond question the life he has chosen for himself. Hinx appears and a vicious fight ensues. At a high-tech facility in the desert Bond and Swann meet Oberhauser, He amasses information to manipulate events and is about to gain control of a global surveillance network. After Oberhauser tortures Bond and reveals himself to be Ernst Stavro Blofeld, Bond and Swann escape and destroy the base. In London Bond debriefs M, is captured by Blofeld, then rescues Swann. Bond has the opportunity to kill Blofeld but decides to let him live. Bond joins Swann, leaving his old life behind.", "cast": "Daniel Craig, Christoph Waltz, Léa Seydoux, Ralph Fiennes, Monica Bellucci, Ben Whishaw, Naomie Harris, Dave Bautista, Andrew Scott, Rory Kinnear, Jesper Christensen", "producers": "Michael G. Wilson, Barbara Broccoli", "director": "Sam Mendes", "release date": "26 October 2015 (UK), 6 November 2015 (USA)", "world premiere": "26 October 2015, The Royal Albert Hall, London", "locations": "Pinewood Studios, London locations, UK; Lake Altaussee, Obertilliach and Sölden, Austria; Rome, Italy; Mexico City, Mexico; Tangier, Erfoud and Sahara desert, Morocco", "music": "“Writing's On The Wall” – performed by Sam Smith, written by Sam Smith and Jimmy Napes", "vehicles": "Aston Martin DB5, Aston Martin DB10, Jaguar C-X75, Rolls-Royce Silver Wraith, Land Rover Discovery Sport SVR, Land Rover Defender Big Foot,  Fiat 500, Britten-Norman BN-2 Islander aircraft, McDonnell Douglas MD500E, AgustaWestland AW109. Messerschmitt-Bolkow-Blohm Bo 105", "gadgets/weapons/technology": "The pre-title Day of the Dead sequence employed 1,520 extras, dressed and made up by 107 different make-up artists, 98 of whom were local. On each working day it took three and a half hours to get the crowd prepared", "trivia": "The pre-title Day of the Dead sequence employed 1,520 extras, dressed and made up by 107 different make-up artists, 98 of whom were local. On each working day it took three and a half hours to get the crowd prepared", "bond actor": "Daniel Craig", "trailer": "https://www.youtube.com/embed/jDwXkDSuxBY?feature=oembed&rel=0&controls=0&showinfo=0&modestbranding=1&"}, {"image": "https://www.007.com/wp-content/uploads/2021/01/SkyfallPoster.jpg", "title": "Skyfall", "synopsis": "James Bond chases assassin Patrice through the streets of Istanbul to recover a flash drive containing the names of every MI6 and NATO agent embedded in terrorist organisations around the world. As Bond and Patrice fight on top of a moving train, on M's orders field agent Eve attempts to shoot Patrice, but she hits Bond. He falls 300 feet into the water below and is presumed dead. MI6 is attacked, forcing M to relocate the agency underground. These events cause her authority and position to be challenged by Mallory, the new chairman of the Intelligence and Security Committee. Bond returns broken and full of doubts. He fails MI6's physical and psychological tests, but M lies to him and tells him he has passed, and she sends him on a mission to track down Patrice in Shanghai. Assuming Patrice's identity, Bond follows clues that lead him to Severine in Macau, and then to her master, Silva, on an abandoned island. Silva is a former MI6 agent seeking revenge for M's betrayal of him, but Bond captures him before he can carry out his plan. As M goes in front of a board of inquiry, and Q tries to hack into Silva's computer, Silva escapes and Bond goes in pursuit. Silva attacks the board of inquiry, but Bond gets M out safely and drives her north to his ancestral home in Scotland, Skyfall. With the help of groundskeeper Kincade, Bond and M defend Skyfall from Silva's assault, and defeat him, but not before M receives a fatal wound. Later Bond reports to Mallory – the new M – and is ready to take on his new mission.", "cast": "Daniel Craig, Javier Bardem, Judi Dench, Ralph Fiennes, Naomie Harris, Bérénice Marlohe, Albert Finney, Ben Whishaw, Rory Kinnear, Ola Rapace, Helen McCory", "producers": "Michael G. Wilson, Barbara Broccoli", "director": "Sam Mendes", "release date": "26 October 2012 (UK), 9 November 2012 (USA)", "world premiere": "23 October 2012, The Royal Albert Hall, London", "locations": "Longcross & Pinewood Studios, London locations, and Hankley Common, Surrey, England; Glencoe, Scotland; Shanghai, China; Istanbul, Fethiye, Adana, and Calis Beach, Turkey", "music": "“Skyfall” –performed by Adele, written by Adele and Paul Epworth", "vehicles": "Aston Martin DB5, Audi A5, AW101 helicopter, London underground train, Jaguar XJ8, Land Rover Defender, Land Rover Discovery 4, Mercedes S-class (W221), Range Rover (L322, series III)", "gadgets/weapons/technology": "Although the opening sequence lasts only 12 minutes on screen, it took three months of rehearsals and two months of filming to produce", "trivia": "Although the opening sequence lasts only 12 minutes on screen, it took three months of rehearsals and two months of filming to produce", "bond actor": "Daniel Craig", "trailer": "https://www.youtube.com/embed/HWWe4wm7JcE?feature=oembed&rel=0&controls=0&showinfo=0&modestbranding=1&"}, {"image": "https://www.007.com/wp-content/uploads/2021/01/QOSposter.jpg", "title": "Quantum Of Solace", "synopsis": "Quantum Of Solace starts 10 minutes after the end of Casino Royale. Bond's search for answers behind Vesper's betrayal leads him to uncover QUANTUM, a sinister organisation whose tentacles spread across the globe, with double agents buried within the British government, MI6 and the CIA. Evidence takes him to Haiti, where he meets Camille. She is an agent who has her own vengeance-fuelled agenda, to avenge her family's deaths at the hands of former Bolivian dictator General Medrano. Posing as the girlfriend of faux-environmentalist Dominic Greene, she becomes suspicious of his land acquisition and business relationship with Medrano. With Bond by her side, they discover Greene is part of QUANTUM, an organisation that is secretly appropriating all of Bolivia's water supply and replacing its left-of-centre president with a more pliable leader.", "cast": "Daniel Craig, Olga Kurylenko, Mathieu Amalric, Judi Dench, Giancarlo Giannini, Gemma Arterton, Jeffrey Wright, Jesper Christensen, Anatole Taubman, Rory Kinnear, Tim Pigott-Smith, Joaquín Cosio", "producers": "Michael G. Wilson, Barbara Broccoli", "director": "Marc Forster", "release date": "31 October 2008 (UK), 14 November 2008 (USA)", "world premiere": "29 October 2008, Odeon Leicester Square, London", "locations": "Bruneval Barracks, Montgomary Lines in Aldershot, Farnborough Airport, Bodyflight, Bedford, Virgin's 'The Base' Crawley. The Reform Club, London, Pinewood Studios, England; Howard Airport, Casa Vejo, Panama City, Coco Solo, Cabra Island, Colon, Panama; The ESO Paranal, Atacama desert, Chile; Torre di Talamonaccio, Siena, Lake Garda, Carrera, Italy; Bregenz, Austria; Baja California, Mexico", "music": "“Another Way To Die” – performed by Jack White and Alicia Keys, composed by David Arnold", "vehicles": "Aston Martin DBS, Alfa Romeos (156, 159), Bell UH-1H Huey helicopter, Douglas DC-3, Sunseeker Superhawk 43, Ford Ka, Indigenious boat, Montesa motorbike, Ford Edge, Volkswagen Beetle, Range Rover Sport", "gadgets/weapons/technology": "For the stunt where Bond and Camille freefall out of the DC3 aircraft, Daniel Craig and Olga Kurylenko performed it at a wind tunnel facility called Bodyflight. 'Flying' in the wind tunnel is the closest you can come to freefalling 10,000 feet without actually jumping out of a plane", "trivia": "For the stunt where Bond and Camille freefall out of the DC3 aircraft, Daniel Craig and Olga Kurylenko performed it at a wind tunnel facility called Bodyflight. 'Flying' in the wind tunnel is the closest you can come to freefalling 10,000 feet without actually jumping out of a plane", "bond actor": "Daniel Craig", "trailer": "https://www.youtube.com/embed/RmFipSJxJD4?feature=oembed&rel=0&controls=0&showinfo=0&modestbranding=1&"}, {"image": "https://www.007.com/wp-content/uploads/2012/10/Casino-Royale_1500.jpg", "title": "Casino Royale", "synopsis": "After becoming a 00 agent, James Bond hunts down a bomb maker in Madagascar, which leads him to shady financier Alex Dimitrios in the Bahamas, and then to a plot to blow up the prototype Skyfleet airliner at Miami Airport. By preventing the bombing, Bond leaves criminal banker Le Chiffre on the verge of bankruptcy – Le Chiffre lost his clients' money by betting on Skyfleet's failure on the stock market. Le Chiffre sets up a high-stakes poker game in Montenegro to win back the lost money. Bond attends with Treasury agent Vesper Lynd and wins, but Le Chiffre kidnaps Lynd and tortures Bond in an attempt to regain the winnings. They are saved when Mr White, a senior figure in terrorist organisation QUANTUM, kills Le Chiffre. However, Lynd is secretly working for White and has made a deal with him to save Bond's life. In love with Lynd, Bond resigns from MI6 and travels to Venice with her. There, he realises she has betrayed him and stolen the money. After a gunfight with QUANTUM's men in a collapsing Venetian villa, Lynd lets herself drown because she cannot bear the burden of her guilt. Bond pursues White and shoots him in the leg, then introduces himself; “The name's Bond, James Bond.”", "cast": "Daniel Craig, Eva Green, Mads Mikkelsen, Judi Dench, Jeffrey Wright, Ginacarlo Giannini, Caterina Murino, Simon Abkarian, Isaach De Bankole, Jesper Christensen, Ivana Milicevic, Tobias Menzies, Claudio Santamaria, Sébastien Foucan, Malcolm Sinclair", "producers": "Michael G. Wilson, Barbara Broccoli", "director": "Martin Campbell", "release date": "16 November 2006 (UK), 17 November 2006 (USA)", "world premiere": "14 November 2006, Odeon Leicester Square, London", "locations": "Modrany & Barrandov Studios, Prague and Karlovy Vary, Czech Republic; New Providence and Paradise Island, Bahamas; Dunsfold Aerodrome, Black Park, Buckinghamshire; Pinewood Studios, England; Lake Como & Venice, Italy", "music": "“You Know My Name” – performed by Chris Cornell, composed by Chris Cornell and David Arnold", "vehicles": "Aston Martin DB5, Aston Martin DBS, Notar MD-600N helicopter, Skyfleet S570, Spirit 54 yacht, Sunseeker Predator 108, Texron tanker, Jaguar XJ8, Range Rover Sport, Ford Mondeo", "gadgets/weapons/technology": "Special permission was granted for Bond and Vesper's yacht (the Spirit 54) to sail along the Grand Canal between the Accademia and Rialto bridges, marking the first time in many years a yacht has sailed the Grand Canal", "trivia": "Special permission was granted for Bond and Vesper's yacht (the Spirit 54) to sail along the Grand Canal between the Accademia and Rialto bridges, marking the first time in many years a yacht has sailed the Grand Canal", "bond actor": "Daniel Craig", "trailer": "https://www.youtube.com/embed/l_c4uGxMdws?feature=oembed&rel=0&controls=0&showinfo=0&modestbranding=1&"}]
